<!DOCTYPE html public "-//W3C//DTD HTML 4.01 Transitional//EN"
  "http://www.w3.org/TR/html4/transitional.dtd">
<html lang="ja">
<head>
<title>タイ語をどうにかする実験 [電脳世界の奥底にて]</title>
<meta http-equiv="Content-Type" content="text/html; charset=utf8">
<meta http-equiv="Content-Style-Type" content="text/css">
<meta http-equiv="Content-Script-Type" content="text/javascript">
<link rel="stylesheet" href="lib/zrmain.css" type="text/css">
<style type="text/css"><!--
--></style>
<script type="text/javascript" src="lib/jquery-1.3.2.min.js"></script>
<script type="text/javascript" src="lib/zrmain.js"></script>
<script type="text/javascript" defer src="cgiruby/zrcounter.cgi?name=bxthai"></script>
<script type="text/javascript"><!--
//--></script>
</head>
<body>

<div id="canvas"><!--************************************************-->
<div id="main">

<div id="header">
<table id="site-title"><tr>
<td id="site-title-g">
<img src="image0/texno2.jpg" width="120" height="48"
     alt="ΕΝ Τ&#x1ffc; ΠΥΘΜΕΝΙ ΤΗΣ ΤΕΧΝΟΠΟΛΕΩΣ">
</td>
<td id="site-title-t">
<div id="title">
<span class="lgc">En toi Pythmeni tes TeXnopoleos</span><br>
<span class="ja">［電脳世界の奥底にて］</span>
</div>
</td>
</tr></table>
</div><!--header-->

<div id="navibar">
<span id="navilang">
| <span class="na">en</span>
| <span class="here">ja</span> |
</span>&nbsp;
<a href="./index.html">トップ</a> &gt;
<span class="here">タイ語をどうにかする実験</span>
</div><!--navibar-->


<div id="maintext">
<h1>タイ語をどうにかする実験</h1>

<div class="abstract">
LaTeX において thailatex パッケージの機能を流用（改造）
することで、UTF-8 でのタイ文字の入力および他言語と混在した文書の
組版を試みたもの。
</div>
<div class="important">
<span class="lbl">重要：</span>
このページで配布している一部の zip ファイルについて、
サブディレクトリにあるべきファイルが欠落しているという
誤りがあったので、正しいものに置き換えました。
<span class="cdate">[2008/06/25]</span>
</div>

<div id="table-contents"></div>

<div class="section" id="sec-preparation">
<h2>準備</h2>

<div class="subsection" id="ssec-gadgets">
<h3>用意するもの</h3>

<ul>
<li>thailatex パッケージ （Surapant Meknavin 氏作）
<a href="http://www.ring.gr.jp/pub/text/CTAN/language/thai/thailatex.zip">
（CTAN からダウンロード）</a><br>
ただし、インストールには Unix 系のコマンドが必要で、
W32TeX の環境で行うのは非常に困難である。
そこで、W32TeX にインストールされた状態を再現したパッケージ
（ただし容量の都合でフォント本体だけ除いた）
を置いておく。
<ul>
<li><a href="data/thailatex-w32tex.tar.xz">thailatex-w32tex.tar.xz</a>
  <span class="mdate">[2010/07/02]</span><br>
  <em>このパッケージのライセンスは LPPL v1.3c である。</em>
</li>
</ul>
</li>
<li><a href="http://www.cs.cmu.edu/~paisarn/software.html">SWATH</a>
（Paisarn Charoenpornsawat 氏作）
タイ語 LaTeX 文書の前処理に必要なフィルタ。<br>
リンク先にある Windows 用バイナリは不具合がある古い版で満足に使えない。
ソースからのビルドにはやはり Unix 系のコマンドが必要になる。
従って、MinGW でコンパイルしたものを置いておく。
<ul>
<li><a href="data/swath_0.3.3-win.zip">swath_0.3.3-win.zip</a>
  <span class="mdate">[2008/06/25]</span><br>
</li>
<li><a href="data/swath_0.3.3.tar.gz">swath_0.3.3.tar.gz</a>
ソースファイル。thailinux のオリジナルのアーカイブ。<br>
  <em>このパッケージのライセンスは GPL v2 である。</em>
</li>
</ul>
</li>
<li>unicode パッケージ
<a href="http://www.ring.gr.jp/pub/text/CTAN/macros/latex/contrib/unicode/">
（CTAN からダウンロード）</a>
</li>
<li>Perl（5.8.0 版以降） 
</li>
<li>最後に拙作の BXthai パッケージ
<ul>
<li><a href="data/bxthai.zip">bxthai.zip (v0.1) のダウンロード</a>
  <span class="mdate">[2008/03/29]</span>
</li>
</ul>
</li>
</ul>

</div><!--ssec-gadgets-->

<div class="subsection" id="ssec-install">
<h3>インストール</h3>

<p>W32TeX でのインストールでの注意点を挙げておく。
</p>
<ul>
<li>thailatex-w32tex.zip は展開後の thailatex-w32tex/texmf
の中身を TEXMF ツリーのいずれかにコピーする。
（残りのファイルは不要。）
このパッケージには Type1 フォントファイルが含まれていないので、
本家の thailatex.zip アーカイブの中の thailatex/fonts にある
*.pfb ファイルを先の TEXMF 以下の fonts/type1/public/thai
にコピーする。
その後、updmap の項目に thai.map を追加する。
<pre>
mktexlsr
updmap --add thai.map
</pre>
</li>
<li>swath_0.3.3-win.zip は展開後の swath_0.3.3-win の中の
swath.exe と swathdata を実行パスの通ったフォルダにコピーする。
（残りのファイル、および swath_0.3.3.tar.gz は不要。）
</li>
<li>BXthai パッケージに関しては、bxswath.pl
を実行パスの通ったフォルダに、
残りは $TEXMF/tex/latex/BXthai に入れておく。
</li>
</ul>
<p>なお、以下の説明では Perl スクリプト bxswath.pl をコマンド bxswath
として扱う。
W32TeX でこれを実現するには、
W32TeX の実行ファイルを収めたフォルダの中にある runscr.exe を
bxswath.pl のあるフォルダに
bxswath.exe という名でコピーすればよい。
</p>

</div><!--ssec-install-->

</div><!--sec-preparation-->

<div class="section" id="sec-usage">
<h2>使用法</h2>

<div class="subsecion" id="ssec-utf8">
<h3>UTF-8 で入力する場合</h3>

<p>タイ語を含む LaTeX 文書を UTF-8 で記述した場合、
プレアンブルで inputenc にオプション <code>utf8x</code>
を指定する。
そして babel を読み込んだ後に bxthai パッケージを読み込む。
（他の言語がないとエラーになるので、その場合は
<code>english</code> 等を取り敢えず入れておく。）
</p>
<pre>
\usepackage[utf8x]{inputenc}
\usepackage[〈他の言語〉,...]{babel}
\usepackage{bxthai}
</pre>
<p>これで、タイ語の言語オプション <code>thai</code>
（<code>bxthai</code> ではない）が用意され、
Babel のコマンドを適切に用いてタイ語
（を含む多言語）の文書が作成できる。
一応、thailatex にある次の命令も用意してあるが、
これは単に Babel の類似の働きの命令に展開されるだけなので
thailatex と同じ動作にはならない。
</p>
<ul>
<li><code>\textthai</code> ： 
<code>\foreignlanguage{thai}</code> に展開される。
</li>
<li><code>\thaitext</code>, <code>\thai</code> ： 
<code>\selectlanguage{thai}</code> に展開される。
thailatex の元の命令と異なり、これはキャプション文字列を
タイ語に切り替える。
</li>
</ul>
<p>また、bxthai を babel の後に読む関係で、
このままだとメインの言語
（文書の先頭で有効になる言語）が必然的にタイ語になる。
この辺りの挙動、またキャプション文字列の処理を調整する為に
<a href="pxbase.html#babel">bxbase パッケージ</a>の
<code>\bxcaptionlanguage</code> や <code>\bxmainlanguage</code>
が有用かもしれない。
</p>
<p>thailatex では、タイ語文書での行分割点の判定を
外部プログラム（SWATH 等）の前処理に頼っている。
bxthai もその仕様を引き継ぐが、
タイ語の文字コード TIS-620 を使う thailatex と異なり
bxthai は UTF-8 を使うので、専用のフィルタ
（といっても中で SWATH を呼んでいるのだが）である bxswath
を用いる。
すなわち、元の LaTeX 文書を foo.org.tex とすると、
組版のコマンドは次のようになる。
</p>
<pre>
bxswath &lt; foo.org.tex &gt; foo.tex
latex foo      # あとは通常の LaTeX 文書と同じように
</pre>

</div><!--ssec-utf8-->

<div class="subsecion" id="ssec-tis">
<h3>TIS-620 で入力する場合</h3>

<p>bxthai では UTF-8 の使用を推奨するが、TIS-620 での入力も可能である。
プレアンブルの設定を次のようにする。
</p>
<pre>
\usepackage[bx-tis620]{inputenc}
\usepackage[〈他の言語〉,...]{babel}
\usepackage{bxthai}
</pre>
<p>組版処理の際、bxswath に <code>-t</code> オプションをつける。
（この場合は SWATH を直接用いてもいいのだが…。）
</p>
<pre>
bxswath -t &lt; foo.org.tex &gt; foo.tex
latex foo
</pre>


</div><!--ssec-tis-->


</div><!--sec-usage-->


<div class="section" id="sec-sample">
<h2>サンプル</h2>

<p>最初はタイ語のみからなる文書である。
ここにラテン文字の他言語を混ぜることもできるが、その場合は、
タイ語のフォントの英字部分で印刷される。
またこの例ではわからないが、
キャプション文字列はタイ語のものに切り替わっている。
</p>

<pre>
% This file is encoded in UTF-8.
% It needs to be preprocessed with 'bxswath'.
\documentclass[a4paper]{article}
\usepackage[utf8x]{inputenc}
\usepackage[english]{babel}   % 'english' is dummy
\usepackage{bxthai}
\begin{document}
\section*{&#xE1B;&#xE0F;&#xE34;&#xE0D;&#xE0D;&#xE32;&#xE2A;&#xE32;&#xE01;&#xE25;&#xE27;&#xE48;&#xE32;&#xE14;&#xE49;&#xE27;&#xE22;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE0A;&#xE19;}
\subsection*{&#xE04;&#xE33;&#xE1B;&#xE23;&#xE32;&#xE23;&#xE20;}

&#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48;&#xE01;&#xE32;&#xE23;&#xE22;&#xE2D;&#xE21;&#xE23;&#xE31;&#xE1A;&#xE19;&#xE31;&#xE1A;&#xE16;&#xE37;&#xE2D;&#xE40;&#xE01;&#xE35;&#xE22;&#xE23;&#xE15;&#xE34;&#xE28;&#xE31;&#xE01;&#xE14;&#xE34;&#xE4C;&#xE1B;&#xE23;&#xE30;&#xE08;&#xE33;&#xE15;&#xE31;&#xE27; &#xE41;&#xE25;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE40;&#xE17;&#xE48;&#xE32;&#xE40;&#xE17;&#xE35;&#xE22;&#xE21;&#xE01;&#xE31;&#xE19;&#xE41;&#xE25;&#xE30;&#xE42;&#xE2D;&#xE19;&#xE21;&#xE34;&#xE44;&#xE14;&#xE49;&#xE02;&#xE2D;&#xE07;&#xE1A;&#xE23;&#xE23;&#xE14;&#xE32;
&#xE2A;&#xE21;&#xE32;&#xE0A;&#xE34;&#xE01; &#xE17;&#xE31;&#xE49;&#xE07; &#xE2B;&#xE25;&#xE32;&#xE22;&#xE41;&#xE2B;&#xE48;&#xE07;&#xE04;&#xE23;&#xE2D;&#xE1A;&#xE04;&#xE23;&#xE31;&#xE27; &#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE4C;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE21;&#xE39;&#xE25;&#xE40;&#xE2B;&#xE15;&#xE38;&#xE41;&#xE2B;&#xE48;&#xE07;&#xE2D;&#xE34;&#xE2A;&#xE23;&#xE20;&#xE32;&#xE1E; &#xE04;&#xE27;&#xE32;&#xE21;&#xE22;&#xE38;&#xE15;&#xE34;&#xE18;&#xE23;&#xE23;&#xE21;
&#xE41;&#xE25;&#xE30;&#xE2A;&#xE31;&#xE19;&#xE15;&#xE34;&#xE20;&#xE32;&#xE1E;&#xE43;&#xE19;&#xE42;&#xE25;&#xE01;

&#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48;&#xE01;&#xE32;&#xE23;&#xE44;&#xE21;&#xE48;&#xE19;&#xE33;&#xE1E;&#xE32;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE40;&#xE2B;&#xE22;&#xE35;&#xE22;&#xE14;&#xE2B;&#xE22;&#xE32;&#xE21;&#xE15;&#xE48;&#xE2D;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE0A;&#xE19; &#xE22;&#xE31;&#xE07;&#xE1C;&#xE25;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE2B;&#xE23;&#xE30;&#xE17;&#xE33;&#xE2D;&#xE31;&#xE19;&#xE1B;&#xE48;&#xE32;&#xE40;&#xE16;&#xE37;&#xE48;&#xE2D;&#xE19;
&#xE0B;&#xE35;&#xE48;&#xE07;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE01;&#xE32;&#xE23;&#xE25;&#xE30;&#xE40;&#xE21;&#xE34;&#xE14;&#xE21;&#xE42;&#xE19;&#xE18;&#xE23;&#xE23;&#xE21;&#xE02;&#xE2D;&#xE07;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE0A;&#xE32;&#xE15;&#xE34;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE23;&#xE49;&#xE32;&#xE22;&#xE41;&#xE23;&#xE07; &#xE41;&#xE25;&#xE30;&#xE43;&#xE15;&#xE49;[&#xE44;&#xE14;&#xE49;]&#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE32;&#xE28;&#xE27;&#xE48;&#xE32;
&#xE1B;&#xE13;&#xE34;&#xE18;&#xE32;&#xE19;&#xE2A;&#xE39;&#xE07;&#xE2A;&#xE38;&#xE14;&#xE02;&#xE2D;&#xE07;&#xE2A;&#xE32;&#xE21;&#xE31;&#xE0D;&#xE0A;&#xE19;&#xE44;&#xE14;&#xE49;&#xE41;&#xE01;&#xE48;&#xE04;&#xE27;&#xE32;&#xE21;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE4C;&#xE21;&#xE35;&#xE0A;&#xE35;&#xE27;&#xE34;&#xE15;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE19;&#xE42;&#xE25;&#xE01;&#xE14;&#xE49;&#xE27;&#xE22;&#xE2D;&#xE34;&#xE2A;&#xE23;&#xE20;&#xE32;&#xE1E;&#xE43;&#xE19;&#xE01;&#xE32;&#xE23;&#xE1E;&#xE39;&#xE14;
&#xE41;&#xE25;&#xE30;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE16;&#xE37;&#xE2D; &#xE41;&#xE25;&#xE30;&#xE2D;&#xE34;&#xE2A;&#xE23;&#xE20;&#xE32;&#xE1E;&#xE1E;&#xE49;&#xE19;&#xE08;&#xE32;&#xE01;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2B;&#xE27;&#xE32;&#xE14;&#xE01;&#xE25;&#xE31;&#xE27;&#xE41;&#xE25;&#xE30;&#xE04;&#xE27;&#xE32;&#xE21;&#xE15;&#xE49;&#xE2D;&#xE07;&#xE01;&#xE32;&#xE23;

&#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE01;&#xE32;&#xE23;&#xE08;&#xE33;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE22;&#xE34;&#xE48;&#xE07;&#xE17;&#xE35;&#xE48;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE0A;&#xE19;&#xE04;&#xE27;&#xE23;&#xE44;&#xE14;&#xE49;&#xE23;&#xE31;&#xE1A;&#xE04;&#xE27;&#xE32;&#xE21;&#xE04;&#xE38;&#xE49;&#xE21;&#xE04;&#xE23;&#xE2D;&#xE07;&#xE42;&#xE14;&#xE22;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE1A;&#xE31;&#xE07;&#xE04;&#xE31;&#xE1A;&#xE02;&#xE2D;&#xE07;&#xE01;&#xE0E;&#xE2B;&#xE21;&#xE32;&#xE22;
&#xE16;&#xE49;&#xE32;&#xE44;&#xE21;&#xE48;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE07;&#xE04;&#xE4C;&#xE08;&#xE30;&#xE43;&#xE2B;&#xE49;&#xE04;&#xE19;&#xE15;&#xE01;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE19;&#xE1A;&#xE31;&#xE07;&#xE04;&#xE31;&#xE1A;&#xE43;&#xE2B;&#xE49;&#xE2B;&#xE31;&#xE19;&#xE40;&#xE02;&#xE49;&#xE32;&#xE2B;&#xE32;&#xE01;&#xE32;&#xE23;&#xE02;&#xE1A;&#xE16;&#xE02;&#xE31;&#xE14;&#xE02;&#xE37;&#xE19;&#xE15;&#xE48;&#xE2D;&#xE17;&#xE23;&#xE23;&#xE32;&#xE0A;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE01;&#xE14;&#xE02;&#xE35;&#xE48;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE27;&#xE34;&#xE16;&#xE35;&#xE17;&#xE32;&#xE07;&#xE2A;&#xE38;&#xE14;&#xE17;&#xE49;&#xE32;&#xE22;

&#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE01;&#xE23;&#xE41;&#xE2B;&#xE48;&#xE07;&#xE2A;&#xE2B;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE32;&#xE15;&#xE34;&#xE44;&#xE14;&#xE49;&#xE22;&#xE37;&#xE19;&#xE22;&#xE31;&#xE19;&#xE44;&#xE27;&#xE49;&#xE43;&#xE19;&#xE01;&#xE0E;&#xE1A;&#xE31;&#xE15;&#xE23;&#xE16;&#xE36;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE0A;&#xE37;&#xE48;&#xE2D;&#xE21;&#xE31;&#xE48;&#xE19;&#xE43;&#xE19;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE0A;&#xE19;&#xE2D;&#xE31;&#xE19;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE21;&#xE39;&#xE25;
&#xE43;&#xE19;&#xE40;&#xE01;&#xE35;&#xE22;&#xE23;&#xE15;&#xE34;&#xE28;&#xE31;&#xE01;&#xE14;&#xE34;&#xE4C;&#xE41;&#xE25;&#xE30;&#xE04;&#xE38;&#xE13;&#xE04;&#xE48;&#xE32;&#xE02;&#xE2D;&#xE07;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE4C;&#xE41;&#xE25;&#xE30;&#xE43;&#xE19;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE40;&#xE17;&#xE48;&#xE32;&#xE40;&#xE17;&#xE35;&#xE22;&#xE21;&#xE01;&#xE31;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE1A;&#xE23;&#xE23;&#xE14;&#xE32;&#xE0A;&#xE32;&#xE22;&#xE41;&#xE25;&#xE30;&#xE2B;&#xE0D;&#xE34;&#xE07;
&#xE41;&#xE25;&#xE30;&#xE44;&#xE14;&#xE49;&#xE15;&#xE01;&#xE25;&#xE07;&#xE43;&#xE08;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE2A;&#xE48;&#xE07;&#xE40;&#xE2A;&#xE23;&#xE34;&#xE21;&#xE04;&#xE27;&#xE32;&#xE21;&#xE01;&#xE49;&#xE32;&#xE27;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE17;&#xE32;&#xE07;&#xE2A;&#xE31;&#xE07;&#xE04;&#xE21; &#xE41;&#xE25;&#xE30;&#xE21;&#xE32;&#xE15;&#xE23;&#xE10;&#xE32;&#xE19;&#xE41;&#xE2B;&#xE48;&#xE07;&#xE0A;&#xE35;&#xE27;&#xE34;&#xE15;&#xE17;&#xE35;&#xE48;&#xE14;&#xE35;&#xE02;&#xE36;&#xE49;&#xE19;&#xE14;&#xE49;&#xE27;&#xE22;&#xE43;&#xE19;&#xE2D;&#xE34;&#xE2A;&#xE23;&#xE20;&#xE32;&#xE1E;
&#xE2D;&#xE31;&#xE19;&#xE01;&#xE27;&#xE49;&#xE32;&#xE07;&#xE02;&#xE27;&#xE32;&#xE07;&#xE22;&#xE34;&#xE48;&#xE07;&#xE02;&#xE36;&#xE49;&#xE19;

&#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48;&#xE23;&#xE31;&#xE10;&#xE2A;&#xE21;&#xE32;&#xE0A;&#xE34;&#xE01;&#xE15;&#xE48;&#xE32;&#xE07;&#xE1B;&#xE0E;&#xE34;&#xE0D;&#xE32;&#xE13;&#xE08;&#xE30;&#xE43;&#xE2B;&#xE49;&#xE1A;&#xE23;&#xE23;&#xE25;&#xE38;&#xE16;&#xE36;&#xE07;&#xE0B;&#xE36;&#xE48;&#xE07;&#xE01;&#xE32;&#xE23;&#xE2A;&#xE48;&#xE07;&#xE40;&#xE2A;&#xE23;&#xE34;&#xE21;&#xE01;&#xE32;&#xE23;&#xE40;&#xE04;&#xE32;&#xE23;&#xE1E;&#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE1B;&#xE0E;&#xE34;&#xE1A;&#xE31;&#xE15;&#xE34;&#xE15;&#xE32;&#xE21;&#xE17;&#xE31;&#xE48;&#xE27;&#xE2A;&#xE32;&#xE01;&#xE25;&#xE15;&#xE48;&#xE2D;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE0A;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE34;&#xE2A;&#xE23;&#xE20;&#xE32;&#xE1E;&#xE2B;&#xE25;&#xE31;&#xE01;&#xE21;&#xE39;&#xE25;
&#xE42;&#xE14;&#xE22;&#xE23;&#xE48;&#xE27;&#xE21;&#xE21;&#xE37;&#xE2D;&#xE01;&#xE31;&#xE1A;&#xE2A;&#xE2B;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE32;&#xE15;&#xE34;

&#xE42;&#xE14;&#xE22;&#xE17;&#xE35;&#xE48;&#xE04;&#xE27;&#xE32;&#xE21;&#xE40;&#xE02;&#xE49;&#xE32;&#xE43;&#xE08;&#xE23;&#xE48;&#xE27;&#xE21;&#xE01;&#xE31;&#xE19;&#xE43;&#xE19;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34; &#xE41;&#xE25;&#xE30;&#xE2D;&#xE34;&#xE2A;&#xE23;&#xE20;&#xE32;&#xE1E;&#xE40;&#xE2B;&#xE25;&#xE48;&#xE32;&#xE19;&#xE35;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE2A;&#xE34;&#xE48;&#xE07;&#xE2A;&#xE33;&#xE04;&#xE31;&#xE0D;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE22;&#xE34;&#xE48;&#xE07;
&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE43;&#xE2B;&#xE49;&#xE1B;&#xE0F;&#xE34;&#xE0D;&#xE32;&#xE13;&#xE19;&#xE35;&#xE49;&#xE2A;&#xE33;&#xE40;&#xE23;&#xE47;&#xE08;&#xE1C;&#xE25;&#xE40;&#xE15;&#xE47;&#xE21;&#xE1A;&#xE23;&#xE34;&#xE1A;&#xE39;&#xE23;&#xE13;&#xE4C;.

&#xE09;&#xE30;&#xE19;&#xE31;&#xE49;&#xE19; &#xE1A;&#xE31;&#xE14;&#xE19;&#xE35;&#xE49; &#xE2A;&#xE21;&#xE31;&#xE0A;&#xE0A;&#xE32;&#xE08;&#xE36;&#xE07;&#xE1B;&#xE23;&#xE30;&#xE01;&#xE32;&#xE28;&#xE27;&#xE48;&#xE32;

&#xE1B;&#xE0F;&#xE34;&#xE0D;&#xE0D;&#xE32;&#xE2A;&#xE32;&#xE01;&#xE25;&#xE27;&#xE48;&#xE32;&#xE14;&#xE49;&#xE27;&#xE22;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE21;&#xE19;&#xE38;&#xE29;&#xE22;&#xE0A;&#xE19;&#xE19;&#xE35;&#xE49;
&#xE40;&#xE1B;&#xE47;&#xE19;&#xE21;&#xE32;&#xE15;&#xE23;&#xE10;&#xE32;&#xE19;&#xE23;&#xE48;&#xE27;&#xE21;&#xE01;&#xE31;&#xE19;&#xE41;&#xE2B;&#xE48;&#xE07;&#xE04;&#xE27;&#xE32;&#xE21;&#xE2A;&#xE33;&#xE40;&#xE23;&#xE47;&#xE08;&#xE2A;&#xE33;&#xE2B;&#xE23;&#xE31;&#xE1A;&#xE1A;&#xE23;&#xE23;&#xE14;&#xE32;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE01;&#xE23;&#xE41;&#xE25;&#xE30;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE32;&#xE15;&#xE34;&#xE17;&#xE31;&#xE49;&#xE07;&#xE2B;&#xE25;&#xE32;&#xE22;
&#xE40;&#xE1E;&#xE37;&#xE48;&#xE2D;&#xE08;&#xE38;&#xE14;&#xE2B;&#xE21;&#xE32;&#xE22;&#xE1B;&#xE25;&#xE32;&#xE22;&#xE17;&#xE32;&#xE07;&#xE17;&#xE35;&#xE48;&#xE27;&#xE48;&#xE32; &#xE40;&#xE2D;&#xE01;&#xE0A;&#xE19;&#xE17;&#xE38;&#xE01;&#xE04;&#xE19;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE07;&#xE04;&#xE4C;&#xE01;&#xE32;&#xE23;&#xE0A;&#xE2D;&#xE07;&#xE2A;&#xE31;&#xE07;&#xE04;&#xE21;&#xE17;&#xE38;&#xE01;&#xE2D;&#xE07;&#xE04;&#xE4C;&#xE01;&#xE32;&#xE23;
&#xE42;&#xE14;&#xE22;&#xE01;&#xE32;&#xE23;&#xE23;&#xE33;&#xE25;&#xE36;&#xE01;&#xE16;&#xE36;&#xE07;&#xE1B;&#xE0F;&#xE34;&#xE0D;&#xE0D;&#xE32;&#xE19;&#xE35;&#xE49;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE40;&#xE19;&#xE37;&#xE2D;&#xE07;&#xE19;&#xE34;&#xE08; &#xE08;&#xE30;&#xE1A;&#xE32;&#xE01;&#xE1A;&#xE31;&#xE48;&#xE19;&#xE1E;&#xE22;&#xE32;&#xE22;&#xE32;&#xE21;&#xE14;&#xE49;&#xE27;&#xE22;&#xE01;&#xE32;&#xE23;&#xE2A;&#xE2D;&#xE19;&#xE41;&#xE25;&#xE30;&#xE28;&#xE36;&#xE01;&#xE29;&#xE32;
&#xE43;&#xE19;&#xE2D;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE2A;&#xE48;&#xE07;&#xE40;&#xE2A;&#xE23;&#xE34;&#xE21;&#xE01;&#xE32;&#xE23;&#xE40;&#xE04;&#xE32;&#xE23;&#xE1E;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE34;&#xE2A;&#xE23;&#xE20;&#xE32;&#xE1E;&#xE40;&#xE2B;&#xE25;&#xE48;&#xE32;&#xE19;&#xE35;&#xE49;
&#xE41;&#xE25;&#xE30;&#xE14;&#xE49;&#xE27;&#xE22;&#xE21;&#xE32;&#xE15;&#xE23;&#xE01;&#xE32;&#xE23;&#xE2D;&#xE31;&#xE19;&#xE01;&#xE49;&#xE32;&#xE27;&#xE2B;&#xE19;&#xE49;&#xE32;&#xE17;&#xE31;&#xE49;&#xE07;&#xE43;&#xE19;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;&#xE41;&#xE25;&#xE30;&#xE23;&#xE30;&#xE2B;&#xE27;&#xE48;&#xE32;&#xE07;&#xE1B;&#xE23;&#xE30;&#xE40;&#xE17;&#xE28;
&#xE43;&#xE19;&#xE2D;&#xE31;&#xE19;&#xE17;&#xE35;&#xE48;&#xE08;&#xE30;&#xE43;&#xE2B;&#xE49;&#xE21;&#xE35;&#xE01;&#xE32;&#xE23;&#xE22;&#xE2D;&#xE21;&#xE23;&#xE31;&#xE1A;&#xE19;&#xE31;&#xE1A;&#xE16;&#xE37;&#xE2D; &#xE41;&#xE25;&#xE30;&#xE01;&#xE32;&#xE23;&#xE1B;&#xE0F;&#xE34;&#xE1A;&#xE31;&#xE15;&#xE34;&#xE15;&#xE32;&#xE21;&#xE42;&#xE14;&#xE22;&#xE2A;&#xE32;&#xE01;&#xE25;&#xE41;&#xE25;&#xE30;&#xE2D;&#xE22;&#xE48;&#xE32;&#xE07;&#xE40;&#xE1B;&#xE47;&#xE19;&#xE1C;&#xE25;&#xE08;&#xE23;&#xE34;&#xE07;&#xE08;&#xE31;&#xE07;
&#xE17;&#xE31;&#xE49;&#xE07;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE23;&#xE14;&#xE32;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE23;&#xE31;&#xE10;&#xE2A;&#xE21;&#xE32;&#xE0A;&#xE34;&#xE01;&#xE14;&#xE49;&#xE27;&#xE22;&#xE01;&#xE31;&#xE19;&#xE40;&#xE2D;&#xE07;
&#xE41;&#xE25;&#xE30;&#xE43;&#xE19;&#xE1A;&#xE23;&#xE23;&#xE14;&#xE32;&#xE1B;&#xE23;&#xE30;&#xE0A;&#xE32;&#xE0A;&#xE19;&#xE02;&#xE2D;&#xE07;&#xE14;&#xE34;&#xE19;&#xE41;&#xE14;&#xE19;&#xE17;&#xE35;&#xE48;&#xE2D;&#xE22;&#xE39;&#xE48;&#xE43;&#xE15;&#xE31;&#xE2D;&#xE33;&#xE19;&#xE32;&#xE08;&#xE02;&#xE2D;&#xE07;&#xE23;&#xE31;&#xE10;&#xE19;&#xE31;&#xE49;&#xE19; &#xE46;

\end{document}
</pre>
<div class="alert"><span class="lbl">参考：</span> この文章は
「世界人権宣言の前文」であるが、少し特異な構成
（文が段落をまたいでいる）になっている。
タイ語の特性とは無関係である。
</div>
<p>TIS-620 を使う場合はプレアンブルを次のように変える。
また bxswath に <code>-t</code> をつける。
</p>
<pre>
\documentclass[a4paper]{article}
\usepackage[bx-tis620]{inputenc}
\usepackage[english]{babel}
\usepackage{bxthai}
</pre>

<p>次は英語が中心でタイ語を少し含む文書の例である。
bxbase パッケージの <code>\bxmainglanguage</code>
命令でメインの言語を設定している。
タイ語は英語よりも行間を広くとる必要があるので、
タイ語の段落の部分を <code>spacing</code> 環境に入れている。
なお、メインがタイ語の場合（上の例）では、
文書クラスの設定する行間が狭すぎる場合は拡げる措置が自動的にとられる。
</p>
<pre>
% This file is encoded in UTF-8.
% It needs to be preprocessed with 'bxswath'.
\documentclass[a4paper]{article}
\usepackage[scale=.72]{geometry}
\usepackage[utf8x]{inputenc}
\usepackage[T1]{fontenc}        %+ as you like
\usepackage{lmodern}            %+
\usepackage{setspace}           %  for 'spacing' environment
\usepackage[english]{babel}
\usepackage{bxthai}
\usepackage{bxbase}
\bxcaptionlanguage{default}     % leave caption names unchanged
\bxmainlanguage{english}        % main language is english
\begin{document}
\title{Sample Document of bxthai Package}
\author{zrbabbler}
\maketitle

The capital of Thailand (\textthai{&#xE23;&#xE32;&#xE0A;&#xE2D;&#xE32;&#xE13;&#xE32;&#xE08;&#xE31;&#xE01;&#xE23;&#xE44;&#xE17;&#xE22;}) is Bangkok.
This city is, however, called Krung Thep Maha Nakhon
(\textthai{&#xE01;&#xE23;&#xE38;&#xE07;&#xE40;&#xE17;&#xE1E;&#xE21;&#xE2B;&#xE32;&#xE19;&#xE04;&#xE23;}) as official name in Thai,
and in daily life it is shortened to \textit{Krung Thep (\textthai{&#xE01;&#xE23;&#xE38;&#xE07;&#xE40;&#xE17;&#xE1E;&#xE2F;})}.
The English name \textit{Bangkok} originates in the name of the region
in this city, and is believed to result from the wide prevalence
of the misuse by Westerners in old days.

When Bangkok was constructed at the current place in 1782,
King Rama I gave to the city the following very long name:
\begin{quote}
  \begin{spacing}{1.2}\thaitext
    &#xE01;&#xE23;&#xE38;&#xE07;&#xE40;&#xE17;&#xE1E;&#xE21;&#xE2B;&#xE32;&#xE19;&#xE04;&#xE23; &#xE2D;&#xE21;&#xE23;&#xE23;&#xE31;&#xE15;&#xE19;&#xE42;&#xE01;&#xE2A;&#xE34;&#xE19;&#xE17;&#xE23;&#xE4C; &#xE21;&#xE2B;&#xE34;&#xE19;&#xE17;&#xE23;&#xE32;&#xE22;&#xE38;&#xE18;&#xE22;&#xE32;&#xE21;&#xE2B;&#xE32;&#xE14;&#xE34;&#xE25;&#xE01;
    &#xE20;&#xE1E;&#xE19;&#xE1E;&#xE23;&#xE31;&#xE15;&#xE19;&#xE4C; &#xE23;&#xE32;&#xE0A;&#xE18;&#xE32;&#xE19;&#xE35;&#xE1A;&#xE38;&#xE23;&#xE35;&#xE23;&#xE21;&#xE22;&#xE4C; &#xE2D;&#xE38;&#xE14;&#xE21;&#xE23;&#xE32;&#xE0A;&#xE19;&#xE34;&#xE40;&#xE27;&#xE28;&#xE19;&#xE4C; &#xE21;&#xE2B;&#xE32;&#xE2A;&#xE16;&#xE32;&#xE19; &#xE2D;&#xE21;&#xE23;&#xE1E;&#xE34;&#xE21;&#xE32;&#xE19;
    &#xE2D;&#xE27;&#xE15;&#xE32;&#xE23;&#xE2A;&#xE16;&#xE34;&#xE15; &#xE2A;&#xE31;&#xE01;&#xE01;&#xE30;&#xE17;&#xE31;&#xE15;&#xE15;&#xE34;&#xE22;&#xE27;&#xE34;&#xE29;&#xE13;&#xE38;&#xE01;&#xE23;&#xE23;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE4C;
  \end{spacing}
  Krung Thep Mahanakhon Amon Rattanakosin Mahinthara Yuthaya
  Mahadilok Phop Noppharat Ratchathani Burirom Udomratchaniwet
  Mahasathan Amon Piman Awatan Sathit Sakkathattiya Witsanukam Prasit
\end{quote}
This ceremonial name is taught in school today.

\end{document}
</pre>


<p>次は pLaTeX を用いて日本語とタイ語を混在させる例である。
当然、入力は UTF-8 になるので、platex に <code>-kanji=utf8</code>
オプションが必要である。
</p>
<pre>
% このファイルの文字コードは UTF-8
% bxswath による前処理が必要
% platex に -kanji=utf8 が必要
\documentclass[a4paper]{jsarticle}
\usepackage[utf8x]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{lmodern}
\usepackage[english]{babel}
\usepackage{bxthai}
\usepackage{bxbase}
\bxcaptionlanguage{default}
\bxmainlanguage{english}
\begin{document}
\title{bxthai サンプル文書}
\author{zrbabbler}
\maketitle

タイ王国（\textthai{&#xE23;&#xE32;&#xE0A;&#xE2D;&#xE32;&#xE13;&#xE32;&#xE08;&#xE31;&#xE01;&#xE23;&#xE44;&#xE17;&#xE22;}）の首都はバンコクであるが、
この都市の名前はタイ語の正式名称では
「クルンテープマハーナコーン（\textthai{&#xE01;&#xE23;&#xE38;&#xE07;&#xE40;&#xE17;&#xE1E;&#xE21;&#xE2B;&#xE32;&#xE19;&#xE04;&#xE23;}）」であり、
通例これを略して\textsf{「クルンテープ（\textthai{&#xE01;&#xE23;&#xE38;&#xE07;&#xE40;&#xE17;&#xE1E;&#xE2F;}）」}と呼ばれる。
日本語の「バンコク」はこの都市の一部を指す地名の
「バーンコーク（\textthai{&#xE1A;&#xE32;&#xE07;&#xE01;&#xE2D;&#xE01;}）」に由来し、西洋人が誤って
用いたものが広まったと考えられている。

ちなみに、現在のバンコクが建設された時に、国王のラーマ 1 世に
より与えられた名前は次のような非常に長いものである。
\begin{quote}
  \textthai{&#xE01;&#xE23;&#xE38;&#xE07;&#xE40;&#xE17;&#xE1E;&#xE21;&#xE2B;&#xE32;&#xE19;&#xE04;&#xE23; &#xE2D;&#xE21;&#xE23;&#xE23;&#xE31;&#xE15;&#xE19;&#xE42;&#xE01;&#xE2A;&#xE34;&#xE19;&#xE17;&#xE23;&#xE4C; &#xE21;&#xE2B;&#xE34;&#xE19;&#xE17;&#xE23;&#xE32;&#xE22;&#xE38;&#xE18;&#xE22;&#xE32;&#xE21;&#xE2B;&#xE32;&#xE14;&#xE34;&#xE25;&#xE01;
  &#xE20;&#xE1E;&#xE19;&#xE1E;&#xE23;&#xE31;&#xE15;&#xE19;&#xE4C; &#xE23;&#xE32;&#xE0A;&#xE18;&#xE32;&#xE19;&#xE35;&#xE1A;&#xE38;&#xE23;&#xE35;&#xE23;&#xE21;&#xE22;&#xE4C; &#xE2D;&#xE38;&#xE14;&#xE21;&#xE23;&#xE32;&#xE0A;&#xE19;&#xE34;&#xE40;&#xE27;&#xE28;&#xE19;&#xE4C; &#xE21;&#xE2B;&#xE32;&#xE2A;&#xE16;&#xE32;&#xE19; &#xE2D;&#xE21;&#xE23;&#xE1E;&#xE34;&#xE21;&#xE32;&#xE19;
  &#xE2D;&#xE27;&#xE15;&#xE32;&#xE23;&#xE2A;&#xE16;&#xE34;&#xE15; &#xE2A;&#xE31;&#xE01;&#xE01;&#xE30;&#xE17;&#xE31;&#xE15;&#xE15;&#xE34;&#xE22;&#xE27;&#xE34;&#xE29;&#xE13;&#xE38;&#xE01;&#xE23;&#xE23;&#xE21;&#xE1B;&#xE23;&#xE30;&#xE2A;&#xE34;&#xE17;&#xE18;&#xE34;&#xE4C;}\par
  クルンテープマハーナコーン アモーンラッタナコーシン %
  マヒンタラーユッタヤーマハーディロック ポップノッパラッタ %
  ラーチャターニーブリーロム ウドムラーチャニウェート %
  マハーサターン アモーンピマーン アワターンサティット %
  サッカタッティヤウィサヌカムプラシット
\end{quote}
この名前は現在の学校教育でも教えられている。

\end{document}
</pre>
<p>なお、upLaTeX を使う場合は、さらにタイ文字を「欧文扱い」
に変える必要がある。
<a href="pxbase.html">pxcjkcat パッケージ（PXbase バンドル内）</a>
を用いるのが簡便で、プレアンブルに次を追加すればよい。
（詳細は<a href="uplatex.html#ssec-char-alpha">
「upLaTeX を使おう」</a> を参照。）
タイ語は「欧文」として扱われるので、upTeX のもつ和文（CJK）
Unicode 処理能力はここでは役に立たない。
</p>
<pre>
\usepackage[prefercjk]{pxcjkcat} % 'forcecjk' 以外なら可
</pre>

</div><!--sec-sample-->


</div><!--maintext-->

<div id="navibar-sub">
<div class="rightpart">
<a href="#canvas">先頭へ</a>
</div>
<div class="leftpart">
<span class="navilang">
| <span class="na">en</span>
| <span class="here">ja</span> |
</span>&nbsp;
<a href="./index.html">トップ</a> &gt;
<span class="here">タイ語をどうにかする実験</span>
<div class="clearright"></div>
</div>
</div><!--navibar-sub-->
<div id="footer">
<div id="counter-mini"></div>
<div id="copyright">
Copyright &copy; 2008 ZR (Takayuki YATO)
&lt;zrbabbler<!--@gmail
-->&#64;<span class="hdn">(at)</span>yaho<!--.or
-->o.<span class="hdn">(dot)</span>co<!--.tokyo
-->.<span class="hdn">(dot)</span>jp&gt;<br>
Last updated: 2010-07-02
</div>

</div><!--footer-->

</div><!--main-->
</div><!--***********************************************************-->
</body>
</html>
